In [45]:
from pandas import Series,DataFrame
import pandas as pd
import numpy as np
import openpyxl
#参考http://blog.csdn.net/zutsoft/article/details/51509124
a=[['刘玄德','男','语文',98.],['刘玄德','男','体育',60.],['关云长','男','数学',60.],['关云长','男','语文',100.]]  
df=DataFrame(a,columns=['name','sex','course','score'])

In [46]:
df

  name sex course  score
0  刘玄德   男     语文   98.0
1  刘玄德   男     体育   60.0
2  关云长   男     数学   60.0
3  关云长   男     语文  100.0

In [6]:
df.set_index(['name','sex','course'],inplace=True)

In [7]:
df

                 score
name sex course
刘玄德  男   语文       98.0
         体育       60.0
关云长  男   数学       60.0
         语文      100.0

In [10]:
#fiil_value  替换null值
df1 = df.unstack(level=2,fill_value=0)

In [11]:
df1

         score
course      体育    数学     语文
name sex
关云长  男     0.0  60.0  100.0
刘玄德  男    60.0   0.0   98.0

In [12]:
df2 = df1.mean(axis=1,skipna=True)

In [13]:
df2

name  sex
关云长   男      53.333333
刘玄德   男      52.666667
dtype: float64

In [14]:
df1['平均分']=df2

In [15]:
df1

         score                     平均分
course      体育    数学     语文
name sex
关云长  男     0.0  60.0  100.0  53.333333
刘玄德  男    60.0   0.0   98.0  52.666667

In [ ]:
#说明
#首先使用set_index 重建索引，这个函数很厉害，实际上是做了分组（groupby）和重建索引的工作。
#然后用unstack将行转换成列，最后算平均数，然后组合到一起。这里关键用到set_index(),unstack()。
#默认情况下，unstack的操作就是最内层的（这里就是level=2）,
#除了传统分级编号，也可以用名称对其unstack。如果数据在分组中找不到的话会引入NaN。

In [16]:
#方法二 下面用pivot和pivot_table解这个问题：

In [17]:
a=[['刘玄德','男','语文',98.],['刘玄德','男','体育',60.],['关云长','男','数学',60.],['关云长','男','语文',100.]] 
af =DataFrame(a,columns=['name','sex','course','score'])

In [18]:
af

  name sex course  score
0  刘玄德   男     语文   98.0
1  刘玄德   男     体育   60.0
2  关云长   男     数学   60.0
3  关云长   男     语文  100.0

In [22]:
#pivot的前两个参数值分别作用于行和列索引，最后一个参数值则是用于填充DaraFrame的数据列的列名
af2=af.pivot('name','course','score')  #使用pviot

In [23]:
af2

course    体育    数学     语文
name
关云长      NaN  60.0  100.0
刘玄德     60.0   NaN   98.0

In [24]:
af2['avg']=af2.mean(axis=1)

In [25]:
af2.fillna(0)

course    体育    数学     语文   avg
name
关云长      0.0  60.0  100.0  80.0
刘玄德     60.0   0.0   98.0  79.0

In [ ]:
#解决办法3 使用透视表 pivot_table

In [39]:
af.pivot_table('score',index=['name','sex'],columns='course',aggfunc='mean',margins=True,fill_value=0)

course      体育    数学     语文   All
name sex
关云长  男     0.0  60.0  100.0  80.0
刘玄德  男    60.0   0.0   98.0  79.0
All       60.0  60.0   99.0  79.5

In [60]:
# ---- 应用  每个门店每味药每月的零售价，按月显示  ----
# sheetname指定为读取几个sheet，sheet数目从0开始
# 如果sheetname=[0,2]，那代表读取第0页和第2页的sheet
# skiprows=[0]代表读取跳过的行数第0行，不写代表不跳过标题
import openpyxl
dfex1 = pd.read_excel('广深门店零售价格统计表.xlsx',sheetname='data',index_col=0)

In [61]:
print(type(dfex1))

<class 'pandas.core.frame.DataFrame'>

In [62]:
dfex1.head(3)

         Fshop_name   Fitem_code Fitem_name  item_price  months
Fshop_no
3            深圳罗湖分院  10100100001       麸炒白术      0.1170       3
3            深圳罗湖分院  10100100001       麸炒白术      0.1170       4
3            深圳罗湖分院  10100100001       麸炒白术      0.1286       5

In [63]:
dfex1.columns

Index(['Fshop_name', 'Fitem_code', 'Fitem_name', 'item_price', 'months'], dtype='object')

In [68]:
dfex2 = dfex1.pivot_table(values='item_price',
                          index=['Fshop_name','Fitem_code','Fitem_name'],
                          columns='months',
                          aggfunc='mean',
                          margins=True,
                          fill_value=0)

In [70]:
dfex2.head()

months                               1    2    3    4    5      6       7  \
Fshop_name Fitem_code  Fitem_name
中山西区分院     10100100001 麸炒白术        0.0  0.0  0.0  0.0  0.0  0.143  0.1600
           10100100002 炙黄芪         0.0  0.0  0.0  0.0  0.0  0.300  0.3000
           10100100003 茯苓          0.0  0.0  0.0  0.0  0.0  0.132  0.1320
           10100100004 党参          0.0  0.0  0.0  0.0  0.0  0.403  0.4030
           10100100005 甘草          0.0  0.0  0.0  0.0  0.0  0.070  0.1239

months                                  8       9      10      11      12  \
Fshop_name Fitem_code  Fitem_name
中山西区分院     10100100001 麸炒白术        0.1600  0.1567  0.0594  0.1429  0.1500
           10100100002 炙黄芪         0.3000  0.3000  0.3000  0.3000  0.3000
           10100100003 茯苓          0.1320  0.1320  0.1320  0.1320  0.1320
           10100100004 党参          0.4333  0.4333  0.4030  0.4030  0.4030
           10100100005 甘草          0.1292  0.1303  0.1303  0.1327  0.1303

months                                  All
Fshop_name Fitem_code  Fitem_name
中山西区分院     10100100001 麸炒白术        0.138857
           10100100002 炙黄芪         0.300000
           10100100003 茯苓          0.132000
           10100100004 党参          0.411657
           10100100005 甘草          0.120957

In [67]:
dfex2.to_excel('广深门店零售价格统计表01.xls',engine='openpyxl')